// React Icons - це набір іконок, спеціально створений для використання в React-додатках. Вона дозволяє легко та зручно вбудовувати іконки в компоненти React, спрощуючи використання векторних графічних символів. Додавання бібліотеки до проекту виконується за допомогою NPM-пакету: npm install react-icons

// Для використання іконок вам потрібно лише імпортувати потрібний компонент та включити його в ваш JSX-код.
import { HiUser } from "react-icons/hi";

export const BookList = ({ books }) => {
  return (
    <ul>
      {books.map((book) => {

// {' '} - для отступа от текста здесь применена текстовая нода с пробелом.
// Ви можете легко налаштовувати зовнішній вигляд іконок, використовуючи стилі React, передаючи власні класи або інші параметри. Колір іконки вказується в додатковому класі CSS-властивістю color. Розмір іконки визначається числом в атрибуті size, це кількість пікселів. За замовчуванням розмір іконок - 16px.

        return <li key={book.id}><HiUser className="my-icon" size="24"/>{' '}{book.name}</li>;
      })}
    </ul>
  );
};