//1. Створимо файл Product.jsx у папці src та перенесемо туди оголошення компонента Product. Не забудьте експортувати компонент із його файлу.
//2.ім'я файлу компонента Product.jsx має збігаться з назвою самого компонента Product

// src/components/Product.jsx

//3.Компонент повинен повертати лише одне значення, тому у будь-яких двох або більше сусідніх тегів повинен бути спільний батько або порожній тег Fragment <></>


// export const Product = props => {

// 5.Оскільки props – це об'єкт, ми можемо деструктуризувати його у підписі функції.
// export const Product = ({ name, imgUrl, price }) => {

// 6. Для того щоб вказати значення властивостей за замовчуванням, використовується синтаксис значень за замовчуванням під час деструктуризації пропсів. Зараз props.imgUrl матиме значення, навіть якщо його не вказано під час виклику компонента у батька.
export const Product = ({
  name,
  imgUrl = "<https://dummyimage.com/640x480/2a2a2a/ffffff&text=Product+image+placeholder>",
  price,
}) => {

  // Винесемо значення ціни в змінну price, щоб підставити значення змінної в JSX.
  // const price = 999;


  // 4. В самому компоненті Product використаємо отримані пропси в розмітці. 
  
  return (
    <div>
      <h2>{name}</h2>
        <img src={imgUrl} alt={name} width="480" />
			<p>Price: {price} credits</p>
    </div>
  );
};